{
  "lastUpdated": "2026-01-18T17:42:58.983841Z",
  "generatedBy": "Keyword Classifier",
  "totalAlerts": 25,
  "alerts": [
    {
      "id": "b3c324051e44",
      "title": "Former Student Detained by ICE",
      "summary": "A former student of mine was recently detained by ICE, and I’m genuinely worried about their wellbeing. They are undocumented with no current legal status. They were brought to the U.S. as a minor ...",
      "source": "Reddit r/immigration",
      "date": "2026-01-18T04:06:41+00:00",
      "type": "ice"
    },
    {
      "id": "88fbc4f2996b",
      "title": "US apologizes for mistake in deporting Massachusetts college student, but defends her removal",
      "summary": "submitted by    /u/rezwenn   [link]   [comments]",
      "source": "Reddit r/immigration",
      "date": "2026-01-16T19:13:22+00:00",
      "type": "ice"
    },
    {
      "id": "26f6616c5ae8",
      "title": "Told at US Embassy London I’d be recommended for a waiver, but heard nothing since. Anyone had similar?",
      "summary": "Hi, Just looking to see if anyone has had a similar experience. I applied for a B1/B2 visa and had my interview at the U.S. Embassy in London. At the interview, the consular officer told me that al...",
      "source": "Reddit r/immigration",
      "date": "2026-01-18T10:24:51+00:00",
      "type": "ice"
    },
    {
      "id": "c8a01f8cfa8a",
      "title": "MEGATHREAD: Minnesota Raids and General Raids",
      "summary": "Hi all,  Making this thread where we can collectively discuss what is happening in Minnesota.  Before I start, I want to say three things:  As an attorney:  No, nothing they are doing in Minnesota ...",
      "source": "Reddit r/DACA",
      "date": "2026-01-13T01:05:29+00:00",
      "type": "ice"
    },
    {
      "id": "71b8afd34b1c",
      "title": "Ice raids",
      "summary": "Currently in El Paso tx  A lot of ice raids are happening around my area  Specifically at construction sites  It’s sad  the thing that I’ve noticed is that a lot of people here are supporting it! M...",
      "source": "Reddit r/DACA",
      "date": "2026-01-17T16:55:31+00:00",
      "type": "ice"
    },
    {
      "id": "3b4be951a289",
      "title": "Seriously, anyone here got stopped by ICE but was let go?",
      "summary": "Trying to find other posts saying whether or not other DACA recipients who got stopped by ICE were able to continue on with their days, get detained but let go, or got deported all together. I real...",
      "source": "Reddit r/DACA",
      "date": "2026-01-17T14:31:01+00:00",
      "type": "ice"
    },
    {
      "id": "b34651ea06a4",
      "title": "My family & I are paranoid about ICE being spotted locally, yet we’re all here legally. Fear mongering gone too far?",
      "summary": "We’re in a red state and over the past few days, word was ICE booked 200+ hotel rooms locally. And there’s been several sightings in the area, was initially targeting the touristy area linked with ...",
      "source": "Reddit r/askimmigration",
      "date": "2026-01-17T06:08:23+00:00",
      "type": "ice"
    },
    {
      "id": "0facbbaaef78",
      "title": "Friend detained in San Diego",
      "summary": "Hi so my friend called me from an ICE detention center in San Diego and I didn’t see them until late last night. I have tried to look up his A number many times and can’t find anything. Can I do an...",
      "source": "Reddit r/askimmigration",
      "date": "2026-01-17T10:48:59+00:00",
      "type": "ice"
    },
    {
      "id": "d920f2d0a9af",
      "title": "Best real estate agency in Cyprus",
      "summary": "When relocating to Cyprus, is it worth working with real estate agents? What types of property are usually better suited for foreigners on a limited budget? And are really good services like Tranio...",
      "source": "Reddit r/askimmigration",
      "date": "2026-01-17T05:06:04+00:00",
      "type": "ice"
    },
    {
      "id": "92ea17a2557f",
      "title": "Events in Minneapolis show how immigration enforcement has changed. What's the impact? - NPR",
      "summary": "Events in Minneapolis show how immigration enforcement has changed. What's the impact?  NPR",
      "source": "Google News",
      "date": "Sat, 17 Jan 2026 10:00:00 GMT",
      "type": "ice"
    },
    {
      "id": "95d340e2c4bb",
      "title": "Trump's DHS has shot 11 people during immigration enforcement operations since September - NBC News",
      "summary": "Trump's DHS has shot 11 people during immigration enforcement operations since September  NBC News",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 21:24:44 GMT",
      "type": "ice"
    },
    {
      "id": "7f9e01ebfdf3",
      "title": "What to know about recording ICE, interacting with immigration enforcement agents - WHYY",
      "summary": "What to know about recording ICE, interacting with immigration enforcement agents  WHYY",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 22:18:45 GMT",
      "type": "ice"
    },
    {
      "id": "202ffdde6613",
      "title": "Small Minneapolis businesses hit hard by ICE crackdown, while corporations stay silent - Reuters",
      "summary": "Small Minneapolis businesses hit hard by ICE crackdown, while corporations stay silent  Reuters",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 18:36:58 GMT",
      "type": "ice"
    },
    {
      "id": "3b21fd925915",
      "title": "Minnesota ICE surge: Judge limits federal actions at Minnesota protests - MPR News",
      "summary": "Minnesota ICE surge: Judge limits federal actions at Minnesota protests  MPR News",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 11:45:00 GMT",
      "type": "ice"
    },
    {
      "id": "57ea555f2acf",
      "title": "Readers Write: Supporting immigration enforcement, U.S. Attorney’s office, ICE - Star Tribune",
      "summary": "Readers Write: Supporting immigration enforcement, U.S. Attorney’s office, ICE  Star Tribune",
      "source": "Google News",
      "date": "Sat, 17 Jan 2026 00:02:20 GMT",
      "type": "ice"
    },
    {
      "id": "f2cb8465f42b",
      "title": "Know your rights: How to navigate an ICE encounter - KUOW",
      "summary": "Know your rights: How to navigate an ICE encounter  KUOW",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 22:55:09 GMT",
      "type": "ice"
    },
    {
      "id": "181283f06766",
      "title": "ICE activity is quiet in Northeast Wisconsin, but concern remains of potential enforcement - WLUK",
      "summary": "ICE activity is quiet in Northeast Wisconsin, but concern remains of potential enforcement  WLUK",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 02:10:57 GMT",
      "type": "ice"
    },
    {
      "id": "9734c706cd08",
      "title": "Democrats push anti-ICE bills nationwide after deadly Minneapolis shooting - Fox News",
      "summary": "Democrats push anti-ICE bills nationwide after deadly Minneapolis shooting  Fox News",
      "source": "Google News",
      "date": "Thu, 15 Jan 2026 14:23:10 GMT",
      "type": "ice"
    },
    {
      "id": "ad5ca56f5dc2",
      "title": "Growing frustration over Boston’s police accountability system on display at community forum - The Boston Globe",
      "summary": "Growing frustration over Boston’s police accountability system on display at community forum  The Boston Globe",
      "source": "Google News",
      "date": "Sun, 18 Jan 2026 15:43:10 GMT",
      "type": "ice"
    },
    {
      "id": "5dc609a2234a",
      "title": "State-by-State Analysis Shows Uneven Progress on U.S. Police Accountability Reforms - Johns Hopkins Bloomberg School of Public Health",
      "summary": "State-by-State Analysis Shows Uneven Progress on U.S. Police Accountability Reforms  Johns Hopkins Bloomberg School of Public Health",
      "source": "Google News",
      "date": "Mon, 18 Aug 2025 07:00:00 GMT",
      "type": "ice"
    },
    {
      "id": "9005838a35e4",
      "title": "OPINION | Seattle Says Police Accountability Is Complete. Victims' Families Know It Isn't. - South Seattle Emerald",
      "summary": "OPINION | Seattle Says Police Accountability Is Complete. Victims' Families Know It Isn't.  South Seattle Emerald",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 17:00:00 GMT",
      "type": "ice"
    },
    {
      "id": "2b8eb1a26359",
      "title": "Talbot's Police Accountability Board says ICE enforcement a concern of residents - The Star Democrat",
      "summary": "Talbot's Police Accountability Board says ICE enforcement a concern of residents  The Star Democrat",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 23:30:00 GMT",
      "type": "ice"
    },
    {
      "id": "fe6a6a183f72",
      "title": "East Lansing Police Oversight Commission Will Look to Increase Community Involvement - East Lansing Info",
      "summary": "East Lansing Police Oversight Commission Will Look to Increase Community Involvement  East Lansing Info",
      "source": "Google News",
      "date": "Fri, 16 Jan 2026 17:00:00 GMT",
      "type": "ice"
    },
    {
      "id": "c931e71c18a6",
      "title": "Was Renee Good Obligated to Comply With an ICE Agent’s Orders? - The New York Times",
      "summary": "Was Renee Good Obligated to Comply With an ICE Agent’s Orders?  The New York Times",
      "source": "Google News",
      "date": "Thu, 15 Jan 2026 23:50:36 GMT",
      "type": "ice"
    },
    {
      "id": "82f85ad65648",
      "title": "Police Leaders Agree to Suspend Sergeant for Violating Rights of Black Driver During Downtown Traffic Stop - WTTW",
      "summary": "Police Leaders Agree to Suspend Sergeant for Violating Rights of Black Driver During Downtown Traffic Stop  WTTW",
      "source": "Google News",
      "date": "Mon, 12 Jan 2026 11:09:56 GMT",
      "type": "ice"
    }
  ]
}