{
  "lastUpdated": "2026-01-18T17:46:26.864340+00:00",
  "totalStates": 51,
  "totalArticles": 510,
  "states": {
    "AK": {
      "state": "Alaska",
      "articleCount": 10,
      "latestArticle": "Video shows police tackle, use Taser on man while he was holding his toddler: ‘Don’t feel like it was right’ - WWNY"
    },
    "FL": {
      "state": "Florida",
      "articleCount": 10,
      "latestArticle": "The state of police reform in Florida: Local efforts vs. state pushback - The FAMUAN"
    },
    "AL": {
      "state": "Alabama",
      "articleCount": 10,
      "latestArticle": "Grand jury recommends abolishing Alabama police department because of a 'culture of corruption' - Police1"
    },
    "CT": {
      "state": "Connecticut",
      "articleCount": 10,
      "latestArticle": "Pending complaints against police would be secret under Connecticut bill - CT Mirror"
    },
    "AZ": {
      "state": "Arizona",
      "articleCount": 10,
      "latestArticle": "Phoenix rolls out early warning software system to predict police misconduct - azcentral.com and The Arizona Republic"
    },
    "CO": {
      "state": "Colorado",
      "articleCount": 10,
      "latestArticle": "Oral arguments scheduled in two Colorado Springs alleged police brutality cases - FOX21 News Colorado"
    },
    "AR": {
      "state": "Arkansas",
      "articleCount": 10,
      "latestArticle": "Suspect injured after shooting involving police in Dallas County - thv11.com"
    },
    "CA": {
      "state": "California",
      "articleCount": 10,
      "latestArticle": "Commentary: ICE can't be trusted. Can California force accountability? - Los Angeles Times"
    },
    "GA": {
      "state": "Georgia",
      "articleCount": 10,
      "latestArticle": "Commissioner calls for effective investigations into alleged police violence during 2024 protests in Georgia - coe.int"
    },
    "DE": {
      "state": "Delaware",
      "articleCount": 10,
      "latestArticle": "‘Torture of our clients’: Lawsuit targets ex-Delaware trooper, other cops, for violent response to ‘ding, dong, ditch’ prank by teens - WHYY"
    },
    "ME": {
      "state": "Maine",
      "articleCount": 10,
      "latestArticle": "New Law Requires Maine Police To Be More Transparent About Misconduct - Pulitzer Center"
    },
    "ID": {
      "state": "Idaho",
      "articleCount": 10,
      "latestArticle": "Office of Police Accountability releases 2024 report, recommends more 'effective communication' - Boise State Public Radio"
    },
    "HI": {
      "state": "Hawaii",
      "articleCount": 10,
      "latestArticle": "Police lieutenant under investigation for suspected abuse of downtown parking privilege - Hawaii News Now"
    },
    "IA": {
      "state": "Iowa",
      "articleCount": 10,
      "latestArticle": "Iowa Police Take 88 Children From Church Camp Over Abuse Allegations - Newsweek"
    },
    "KS": {
      "state": "Kansas",
      "articleCount": 10,
      "latestArticle": "Examine Kansas City police accountability in 11 articles on DeValkenaere’s conviction and clemency - Kansas City Star"
    },
    "IN": {
      "state": "Indiana",
      "articleCount": 10,
      "latestArticle": "How to report Indianapolis police misconduct allegations - IndyStar"
    },
    "LA": {
      "state": "Louisiana",
      "articleCount": 10,
      "latestArticle": "Evansville Police name officer involved in E. Louisiana St. shooting - WFIE | 14 News"
    },
    "MD": {
      "state": "Maryland",
      "articleCount": 10,
      "latestArticle": "Maryland attorney general’s first police misconduct charges dismissed - The Washington Post"
    },
    "IL": {
      "state": "Illinois",
      "articleCount": 10,
      "latestArticle": "Sonya Massey: Ex-officer guilty of her murder in Illinois - BBC"
    },
    "KY": {
      "state": "Kentucky",
      "articleCount": 10,
      "latestArticle": "A year after deadly Kentucky police raid, the public is still demanding answers - Lexington Herald Leader"
    },
    "NV": {
      "state": "Nevada",
      "articleCount": 10,
      "latestArticle": "Nevada Avenue Officer Involved Shooting Update - El Paso County Jail"
    },
    "NE": {
      "state": "Nebraska",
      "articleCount": 10,
      "latestArticle": "UNK Police recognized as Accredited Law Enforcement Agency in Nebraska - UNK NEWS"
    },
    "MT": {
      "state": "Montana",
      "articleCount": 10,
      "latestArticle": "BIA officer charged with sexually assaulting Northern Cheyenne teen faces other lawsuits - Daily Montanan"
    },
    "MA": {
      "state": "Massachusetts",
      "articleCount": 10,
      "latestArticle": "Police make arrest in Massachusetts shooting - MassLive.com"
    },
    "MN": {
      "state": "Minnesota",
      "articleCount": 10,
      "latestArticle": "Historian traces police brutality in Minneapolis back to 1800s - MPR News"
    },
    "MO": {
      "state": "Missouri",
      "articleCount": 10,
      "latestArticle": "Missouri Senate Just Passed a First Step in Police Reform as Police Violence Continues. - Everytown"
    },
    "MS": {
      "state": "Mississippi",
      "articleCount": 10,
      "latestArticle": "Amid Trump Turmoil, Will Jackson State Ever Get Justice in Deadly Police Shooting? - The Marshall Project"
    },
    "MI": {
      "state": "Michigan",
      "articleCount": 10,
      "latestArticle": "30-year-old man fatally shot by police officer in Eaton Rapids, police say - Lansing State Journal"
    },
    "NH": {
      "state": "New Hampshire",
      "articleCount": 10,
      "latestArticle": "Police files are subject to public records requests, NH Supreme Court rules - New Hampshire Public Radio"
    },
    "NJ": {
      "state": "New Jersey",
      "articleCount": 10,
      "latestArticle": "Man dies after being shot by New Jersey State Police detective in Berlin Township - 6abc Philadelphia"
    },
    "ND": {
      "state": "North Dakota",
      "articleCount": 10,
      "latestArticle": "Minot Police Officers Hall, Burtch receive North Dakota Medal of Honor - KFYR-TV"
    },
    "NM": {
      "state": "New Mexico",
      "articleCount": 10,
      "latestArticle": "Santa Fe police officer on desk duty, prohibited from having guns after felony indictment - Santa Fe New Mexican"
    },
    "OK": {
      "state": "Oklahoma",
      "articleCount": 10,
      "latestArticle": "Investigators say Lincoln County property dispute led to shooting with deputy - News 9"
    },
    "RI": {
      "state": "Rhode Island",
      "articleCount": 10,
      "latestArticle": "RI state police investigate after crash, shooting closed I-95 for hours on Monday - The Providence Journal"
    },
    "OR": {
      "state": "Oregon",
      "articleCount": 10,
      "latestArticle": "Draft report by Oregon police agency blasts Deschutes County sheriff for lying - Oregon Public Broadcasting - OPB"
    },
    "PA": {
      "state": "Pennsylvania",
      "articleCount": 10,
      "latestArticle": "Pa. lawmakers fight for accountable policing, introduce bill to unmask federal ICE agents - Chester County Press"
    },
    "NC": {
      "state": "North Carolina",
      "articleCount": 10,
      "latestArticle": "Fayetteville police officer accused of sexual misconduct to appear in court in August - CityView NC"
    },
    "OH": {
      "state": "Ohio",
      "articleCount": 10,
      "latestArticle": "3News Investigates: Akron settles 2 excessive force lawsuits involving 2024 police incidents - WKYC"
    },
    "NY": {
      "state": "New York",
      "articleCount": 10,
      "latestArticle": "What we found so far in decades of NY police misconduct documents - Democrat and Chronicle"
    },
    "SC": {
      "state": "South Carolina",
      "articleCount": 10,
      "latestArticle": "Former law enforcement officer charged with misconduct in office - WTOC"
    },
    "TN": {
      "state": "Tennessee",
      "articleCount": 10,
      "latestArticle": "Senator says ‘Tennesseans deserve transparency and accountability’ after former troopers reveal DUI quotas led to sober drivers’ arrests - WSMV"
    },
    "SD": {
      "state": "South Dakota",
      "articleCount": 10,
      "latestArticle": "Violence against police is becoming more common in Rapid City - KOTA Territory News"
    },
    "VT": {
      "state": "Vermont",
      "articleCount": 10,
      "latestArticle": "Man dressed as cop threatens woman, real police say - Vermont Daily Chronicle"
    },
    "TX": {
      "state": "Texas",
      "articleCount": 10,
      "latestArticle": "Austin opened up police misconduct files. Now, state lawmakers want to lock them back up. - KUT"
    },
    "VA": {
      "state": "Virginia",
      "articleCount": 10,
      "latestArticle": "BRIM caps payouts for WV victims in police excessive force cases - West Virginia Watch"
    },
    "WY": {
      "state": "Wyoming",
      "articleCount": 10,
      "latestArticle": "The Intersection of Pride and Police Abuse of Power - ACLU of Wyoming"
    },
    "UT": {
      "state": "Utah",
      "articleCount": 10,
      "latestArticle": "Four months, no answers: Family of slain Utah protester presses for justice - Deseret News"
    },
    "WI": {
      "state": "Wisconsin",
      "articleCount": 10,
      "latestArticle": "University of Wisconsin Police investigating stickers promoting violence against ICE - Milwaukee Journal Sentinel"
    },
    "WV": {
      "state": "West Virginia",
      "articleCount": 10,
      "latestArticle": "BRIM caps payouts for WV victims in police excessive force cases - West Virginia Watch"
    },
    "WA": {
      "state": "Washington",
      "articleCount": 10,
      "latestArticle": "U.S. attorney in D.C. considers withholding police misconduct information - The Washington Post"
    },
    "DC": {
      "state": "District of Columbia",
      "articleCount": 10,
      "latestArticle": "Chairman Comer Delivers Remarks in Support of the CLEAN DC Act - House.gov"
    }
  }
}